{
    "name": "Jack Wind",
    "initials": "JW",
    "location": "Arlington, Virginia",
    "locationLink": "https://www.google.com/maps/place/Arlington,+VA",
    "about": "I am fueled by a relentless curiosity. Creating is self-expression, and I create the future I want to see.",
    "summary": "My name is Jack Thomas Windham, but I often go by Jack Wind when introducing and referring to myself. I’m named after my mothers father, Jack Newell, and my fathers father, Thomas Windham. My greatest strengths are my persistence and curiosity.",
    "currently": "I'm quite the busy man right now. I'm teaching myself the field of Artifical Intelligence, making this website, training for a half marathon, and working a full time job. Check out the About or Resume pages for more info!",
    "avatarUrl": "https://avatars.githubusercontent.com/u/32938999?v=4",
    "personalWebsiteUrl": "https://jackwindham.com",
    "contact": {
        "email": "jckwind11@gmail.com",
        "tel": "+13025353508",
        "socials": {
            "github": "https://github.com/Jckwind",
            "linkedin": "https://www.linkedin.com/in/jckwind11/",
            "twitter": "https://x.com/jckwind"
        }
    },
    "education": [
        {
            "school": "Virginia Polytechnic Institute and State University",
            "degree": "Bachelor's Degree in Computer Science",
            "description": "Graduated with a focus on full-stack development. Explored diverse interests: multiple entrepreneurial projects, leadership roles in multiple organizations, and a capstone project on brain modeling. I was also known to tutor peers in math and software development in my free time.",
            "start": "2018",
            "end": "2022"
        }
    ],
    "work": [
        {
            "company": "Capital One",
            "title": "Senior Associate",
            "role": "Software Engineer",
            "link": "https://www.capitalone.com/",
            "badges": ["Hybrid"],
            "start": "February 2024",
            "end": "Present",
            "description": "As an engineer working on Capital One's core platform, I took ownership of critical initiatives within the iOS team, such as improving the architecture and performance of the server-rendered platform. I led the modernization of the iOS codebase by eliminating legacy code, adopting a verbose in-line documentation standard, and prioritizing the end-user experience. My focus on clean, scalable solutions improved both the internal developer experience and platform reliability. My contributions enable iOS feature teams to quickly adopt the server-side platform; driving simple, rapid, and flexible development of the Capital One enterprise. Beyond my technical contributions, I also led a unique onboarding experience that focused on in-office collaboration and networking. During my time, I was recognized for my communication, teamwork, and ability to deliver results.",
            "tech_stack": ["Swift"]
        },
        {
            "company": "Capital One",
            "title": "Associate",
            "role": "Software Engineer",
            "link": "https://www.capitalone.com/",
            "badges": ["Hybrid"],
            "start": "August 2022",
            "end": "January 2023",
            "description": "As an engineer supporting Capital One's Dining & Entertainment (D&E) platform, I led initiatives to protect the integrity of exclusive offerings, optimize platform resilience, and drive data-informed decision & design. My work safeguarding offerings directly enhanced the user experience and preserved our competitive advantage. To ensure seamless service of the Capital One platform, I built a robust availability architecture, vital for regulatory compliance. Working with internal teams and external partners, I designed and developed a data pipeline that provided granular insight into user behavior, empowering continuous improvement of the D&E platform.",
            "tech_stack": ["Go", "Javascript", "AWS", "Jenkins"]
        },
        {
            "company": "Capital One",
            "title": "Intern",
            "role": "Software Engineer",
            "badges": ["Remote"],
            "link": "https://www.capitalone.com/",
            "start": "June 2021",
            "end": "August 2021",
            "description": "To improve enterprise-wide safety and security at Capital One, I built a serverless application to analyze cloud infrastructure for non-compliant security configurations. This tool generated detailed reports and risk assessments, automatically upgrading resources to the latest security requirements where possible. Component owners were notified of any resources requiring manual intervention. I was a core contributor to every aspect of this project, from the design, development and implementation. Technologies: AWS Lambda, S3, IAM, EC2, Python, Github, Jenkins, Bogie, Pytest.",
            "tech_stack": ["Python", "AWS", "Jenkins"]
        },
        {
            "company": "Verisign",
            "title": "Intern",
            "role": "Software Engineer",
            "link": "https://www.verisign.com/",
            "badges": ["Remote"],
            "start": "May 2020",
            "end": "August 2020",
            "description": "To streamline access to critical operational data across the organization, I built a cross-platform application for viewing internal dashboards and important status information. This work included navigating access policies, integrating with existing infrastructure and data sources, and overseeing all phases of platform development.",
            "tech_stack": ["Typescript", "Angular", "Restful API"]
        }
    ],
    "projects": [
        {
            "title": "Cordia",
            "description": "In the spring of 2018, I began developing Cordia, a social media platform for music, which was inspired by a music-sharing group chat with friends. This project progressed in part due to my hands-on approach to learning, starting from naming the platform and designing the logo to addressing technical challenges like switching from a NoSQL to a SQL database. As a college student, I optimized costs by using AWS and Google Cloud's free tiers for backend and user management. Released in October 2019, Cordia allowed users to share music recommendations and connect over shared tastes, integrating with Spotify and Apple Music APIs. Soon after its release, Cordia was recognized in an entrepreneurship competition and development continued. Unfortunately, shifting priorities and the Covid pandemic led to the cessation of active development and promotion and in 2022, I discontinued Cordia's operation. In late 2023, I began working on its revival with an expanded vision, but this redesign is slow-going, as I have to balance this endeavor with other commitments.",
            "short_description": "Cordia began as a passion project sparked by music-sharing with friends. This award-winning social network integrated Spotify and Apple Music for a polished user experience. While building Cordia, I fell in love with the full spectrum of product development; in love with making experiences people enjoy.",
            "link": "https://www.cordia.app",
            "techStack": [
                "Side Project",
                "AWS",
                "Swift",
                "NodeJS",
                "SQL",
                "Google Cloud Platform"
            ]
        },
        {
            "title": "Wind Model",
            "description": "In the summer of 2022, I became obsessed with machine learning. I developed a new personal research project, the Wind Model. Written in Python, the model utilized historical sentiment data and financial data for the binary classification of equity price behavior (predicting whether a stock's price would go up or down). The sentiment data was supplied via the public Twitter API, and the financial data via the public Yahoo Finance API and a private Nasdaq API. The model showed some success, performing exceedingly well in *calm* market conditions but struggling in volatile markets. It was powered by a Hierarchical Navigable Small Worlds (HNSW) algorithm for high-dimensional space analysis and used a genetic optimization algorithm for feature selection. This genetic algorithm was designed to find the optimal feature set for predicting price behavior. The model was retrained nightly, using the previous 30 trading days to optimize the genetic algorithm and identify the current *mood* of the market, or which feature set was most influential in determining price movement. The project was eventually sunsetted due to personal reasons and the high training costs, approximately $600 a month. I have not revisited this project since, not for lack of potential, but rather because my focus is on other projects. I do not plan to open-source the code.",
            "short_description": "The Wind Model tackled the complexities of stock prediction with an adaptive approach, combining technical indicators, real-time market data, and a self-optimizing genetic algorithm for dynamic feature selection.",
            "techStack": [
                "Side Project",
                "AWS",
                "Python"
            ]
        },
        {
            "title": "Flip Flop",
            "description": "Flip Flop was a reflex-challenging, infinite scrolling mobile app that I built to teach myself how to code. The game mechanics were simple yet addictive. It was written in Swift, the programming language used to make iOS apps, and the game’s elements were designed using Photoshop and Illustrator. Monetization was achieved through in-app ads and purchases, including character skins and bonus levels. Flip Flop was a significant project for me, blending coding, design, and entrepreneurial skills. The app released in 2017, and received periodic updates to enhance the user experience and showcase my evolving coding skills. However, as I shifted focus to new projects, Flip Flop was gradually retired. This pivotal project laid the foundation for my future work.",
            "short_description": "Flip Flop was my first project. While simple, this game revealed the power of self-driven learning and sparked my passion for coding and bringing ideas into reality.",
            "techStack": [
                "Side Project",
                "Swift"
            ]
        },
        {
            "title": "Tragedy Relief Index",
            "description": "The Tragedy Relief Index was a small, simple app developed between my Flip Flop and Cordia projects. It featured a simple interface displaying global tragedies and natural disasters, offering users links to assist those impacted. The app, available on the App Store for a few years, was not very popular and was eventually shut down the platform following the closure of its data-providing API.",
            "short_description": "The Tragedy Relief Index was an app focused on connecting users with humanitarian aid resources in response to global disasters. Utilizing a live-updating API, this project highlighted the challenges of external dependency in software solutions. Despite its short lifespan, it reflected my early commitment to using technology for positive impact.",
            "techStack": [
                "Side Project",
                "Swift"
            ]
        },
        {
            "title": "Happy Memories",
            "description": "This was a small, simple app I had made my dad as a gift. Everyday, he would get a notification at a random time, saying that it was time to view his happy memory for the day. Opening the app would show a different picture of the family, along with the description of the family’s happy memory for that day. Simple, but heartwarming. He told me for years after how much he looks forward to seeing his happy memory for the day",
            "short_description": "Happy Memories was a personalized gift for my father. It is an app designed around viewing cherished family moments, each day revealing a different photo and its story. Its simplicity made it meaningful, and showed the positive impact technology makes possible.",
            "techStack": [
                "Side Project",
                "Swift"
            ]
        },
        {
            "title": "RememberThem",
            "description": "RememberThem is a heartfelt, simple app created as a personal gift for my mom. It commemorates her parents, who passed away from cancer. The app features a friendly interface displaying photos of my mom with each parent, alongside a play button. This button activates voicemails from her parents, which I had recorded and refined from our home telephone's answering machine. While I never thought much of the technical effort, the emotional value it holds for my mom is significant, as she continues to cherish and frequently use it.",
            "short_description": "A personal and simple app crafted as a gift for my mom, honors her late parents. It features photos of her with each parent and a play button for voicemails from them, preserved from our home answering machine. Technically straightforward but emotionally invaluable, it remains a cherished part of my mom's life.",
            "techStack": [
                "Side Project",
                "Swift"
            ]
        }
    ],
    "skills": {
        "Technical": [
            "Python",
            "Swift",
            "NodeJS",
            "SQL",
            "Javascript",
            "Java",
            "Backend/Systems Architecture Design",
            "RESTful API Development and Management"
        ],
        "Frameworks": [
            "React+NextJS",
            "Angular"
        ],
        "Cloud & DevOps": [
            "AWS",
            "Azure",
            "Google Cloud",
            "CI/CD Pipeline Development",
            "Automation"
        ],
        "Design": [
            "UI/UX",
            "Web Design",
            "App Design"
        ],
        "Project Management": [
            "Agile",
            "Scrum",
            "Jira"
        ],
        "Machine Learning": [
            "Model Development",
            "Model Architecture Design",
            "Model Optimization",
            "Model Testing"
        ],
        "Strengths": [
            "Decision Making",
            "Adaptability",
            "Impact Oriented"
        ],
        "Certifications": [
            "AWS Certified Developer Associate"
        ]
    }
}