{
    "name": "Jack Wind",
    "initials": "JW",
    "location": "Arlington, VA",
    "locationLink": "https://www.google.com/maps/place/Arlington,+VA",
    "summary": "I bring my ideas into reality with problem-solving and leadership. I have a history of resilience, and continuously improve.",
    "avatarUrl": "https://avatars.githubusercontent.com/u/32938999?v=4",
    "personalWebsiteUrl": "https://jckwind.com",
    "contact": {
        "email": "jckwind11@gmail.com",
        "tel": "+13025353508",
        "socials": {
            "github": "https://github.com/Jckwind",
            "linkedin": "https://www.linkedin.com/in/jckwind11/",
            "twitter": "https://x.com/jckwind"
        }
    },
    "education": [
        {
            "school": "Virginia Tech",
            "degree": "Bachelor of Science in Computer Science",
            "description": "Focused on full-stack development with a passion for diverse projects, including entrepreneurial ventures, leadership roles, and a capstone on brain modeling. I mentored peers in math, computer science, and career development.",
            "start": "2018",
            "end": "2022"
        }
    ],
    "work": [
        {
            "company": "Capital One",
            "role": "Senior Software Engineer",
            "link": "https://www.capitalone.com/",
            "start": "January 2024",
            "end": "Present",
            "description": "While modernizing the iOS codebase and driving platform adoption, I refined my technical skills and embraced leadership opportunities. My contributions to the core platform team enhanced developer experience, improved reliability, and streamlined development processes, ultimately impacting the entire Capital One enterprise. This role fostered both my technical expertise and my ability to lead and collaborate effectively within a team.",
            "tech_stack": [
                "Swift",
                "Leadership"
            ]
        },
        {
            "company": "Capital One",
            "role": "Software Engineer",
            "link": "https://www.capitalone.com/",
            "start": "August 2022",
            "end": "December 2023",
            "description": "I led projects to enhance the security and performance of the Dining & Entertainment platform, with a focus on protecting exclusive offers, ensuring system stability, and building tools to understand user behavior. These efforts directly contributed to Capital One's success and enhanced our competitive edge.",
            "tech_stack": [
                "Go",
                "Javascript",
                "AWS"
            ]
        },
        {
            "company": "Capital One",
            "role": "Software Engineer - Intern",
            "link": "https://www.capitalone.com/",
            "start": "June 2021",
            "end": "August 2021",
            "description": "I developed a serverless application to analyze and enhance cloud security, automating upgrades and generating reports for improved compliance.",
            "tech_stack": [
                "Python",
                "AWS"
            ]
        },
        {
            "company": "Verisign",
            "role": "Software Engineer - Intern",
            "link": "https://www.verisign.com/",
            "start": "May 2020",
            "end": "August 2020",
            "description": "I built a cross-platform application to centralize access to operational data and dashboards, streamlining information sharing across the organization.",
            "tech_stack": [
                "Typescript",
                "Angular"
            ]
        }
    ],
    "projects": [
        {
            "title": "Wind Model",
            "description": "With minimal prior knowledge, I dedicated an entire summer to intensive self-directed learning, exploring the cutting edge of AI and financial prediction. This culminated in the Wind Model, a novel approach to stock price prediction using NLP sentiment analysis, high dimension similarity search and a self-optimizing genetic algorithm. I eventually discontinued research due to high costs; but the Wind Model showcased my ability to rapidly learn and apply complex concepts to challenging problems and develop novel, original solutions.",
            "start": "May 2022",
            "end": "Sept 2022",
            "techStack": [
                "AI/ML Research",
                "Model Design",
                "Genetic Optimization",
                "Python",
                "AWS"
            ]
        },
        {
            "title": "Cordia",
            "description": "Cordia was a social media platform made for music lovers, born from a simple desire to share music with my friends. As a solo founder, this endeavor required me to rapidly learn and grow. Designing an experience people liked, building and iterating a product, and steering an organization towards success were key skills I developed through Cordia. I showcased Cordia in an entrepreneurship competition, where it won first place, and was also voted the crowd favorite. I continued developing Cordia on and off throughout my college years, but ultimately sunset the platform in 2022 due to shifting priorities.",
            "link": "https://www.cordia.app",
            "start": "Aug 2018",
            "end": "Jun 2022",
            "techStack": [
                "AWS",
                "Swift",
                "NodeJS",
                "SQL",
                "Google Cloud"
            ]
        },
        {
            "title": "Tragedy Relief Index",
            "description": "The Tragedy Relief Index was an app focused on connecting users with humanitarian aid resources in response to global disasters. Utilizing a live-updating API, this project highlighted the challenges of external dependency in software solutions. Despite its short lifespan, it reflected my early commitment to using technology for positive impact.",
            "link": "https://appadvice.com/app/tragedy-relief-index/1314576102",
            "start": "2017",
            "end": "2017",
            "techStack": [
                "Swift",
                "Firebase"
            ]
        },
        {
            "title": "Flip Flop",
            "description": "A self-driven project to learn mobile app development. This project combined design, coding, and even a bit of entrepreneurial spirit as I explored monetization strategies. I released it in 2017 and it enjoyed moderate success, but my attention shifted towards other projects and the app was eventually discontinued. It was a significant stepping stone, paving the way for my future endeavors. ",
            "link": "https://appadvice.com/app/flip-flop/1208356042",
            "start": "2017",
            "end": "2020",
            "techStack": [
                "Swift",
                "Google Ads"
            ]
        }
    ],
    "skills": {
        "Technical": [
            "Python",
            "Swift",
            "NodeJS",
            "SQL",
            "Javascript",
            "Java",
            "Backend/Systems Architecture Design",
            "RESTful API Development and Management"
        ],
        "Frameworks": [
            "React+NextJS",
            "Angular"
        ],
        "Cloud & DevOps": [
            "AWS",
            "Azure",
            "Google Cloud",
            "CI/CD Pipeline Development",
            "Automation"
        ],
        "Design": [
            "UI/UX",
            "Web Design",
            "App Design"
        ],
        "Project Management": [
            "Agile",
            "Scrum",
            "Jira"
        ],
        "Machine Learning": [
            "Model Development",
            "Model Architecture Design",
            "Model Optimization",
            "Model Testing"
        ],
        "Strengths": [
            "Decision Making",
            "Adaptability",
            "Impact Oriented"
        ],
        "Certifications": [
            "AWS Certified Developer Associate"
        ]
    }
}